In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [3]:
s[s > 0.5]

a    0.686408
c    0.701709
dtype: float64

In [4]:
s[[2, 4]]

c    0.701709
e   -0.665657
dtype: float64

In [5]:
np.exp(s)

a    1.986568
b    0.228883
c    2.017197
d    0.984710
e    0.513936
dtype: float64

In [6]:
s["a"]

0.6864083920883969

In [7]:
# s["f"] # KeyError except

# Use the get method instead
s.get("f", np.nan)

nan

In [22]:
s2 = pd.DataFrame(np.random.rand(5, 2))
s2

          0         1
0  0.218118  0.415615
1  0.046772  0.743838
2  0.163203  0.208114
3  0.557837  0.519554
4  0.214126  0.081832

# From dict of Series or dicts

The resulting **index** will be the **union** of the indexes of the various Series. If there are any nested dicts, these will first be converted to Series. If no columns are passed, the columns will be the ordered list of dict keys.

In [54]:
d = {
  "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
  "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"])
}

df = pd.DataFrame(d)
df

        one       two
a -0.732758  0.727160
b  0.827219  0.638470
c  0.223872  0.028091
d       NaN -0.972016

In [16]:
pd.DataFrame(d, index=["d", "b", "a"])

        one       two
d       NaN  0.665600
b  0.618542 -1.215648
a  0.731354 -0.434867

In [19]:
pd.DataFrame(d, index=["d", "a"], columns=["two", "three"])

        two three
d  0.665600   NaN
a -0.434867   NaN

In [20]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [21]:
df.columns

Index(['one', 'two'], dtype='object')

### Note: When passing two or more arrays or ndarrays, make sure that their length is the same

In [28]:
pd.DataFrame({"one": np.random.rand(3), "two": np.random.rand(3)})

        one       two
0  0.237920  0.036702
1  0.994622  0.635829
2  0.300992  0.114898

In [53]:
data2 = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]
pd.DataFrame(data2, index=["first", "second"])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [55]:
df.insert(1, "negative", df["one"] < 0)

In [56]:
# [fn for fn in dir(df) if not fn.startswith("_")]

df["three"] = df["one"] * 10
df

        one  negative       two     three
a -0.732758      True  0.727160 -7.327579
b  0.827219     False  0.638470  8.272193
c  0.223872     False  0.028091  2.238715
d       NaN     False -0.972016       NaN

In [61]:
# Use assign method: returns a copy of the df

df.assign(ratio=lambda x: (x["two"] / x["one"] - 5))

        one  negative       two     three     ratio
a -0.732758      True  0.727160 -7.327579 -5.992360
b  0.827219     False  0.638470  8.272193 -4.228173
c  0.223872     False  0.028091  2.238715 -4.874524
d       NaN     False -0.972016       NaN       NaN

In [62]:
help(df.query)

Help on method query in module pandas.core.frame:

query(expr: 'str', inplace: 'bool' = False, **kwargs) method of pandas.core.frame.DataFrame instance
    Query the columns of a DataFrame with a boolean expression.

    Parameters
    ----------
    expr : str
        The query string to evaluate.

        You can refer to variables
        in the environment by prefixing them with an '@' character like
        ``@a + b``.

        You can refer to column names that are not valid Python variable names
        by surrounding them in backticks. Thus, column names containing spaces
        or punctuations (besides underscores) or starting with digits must be
        surrounded by backticks. (For example, a column named "Area (cm^2)" would
        be referenced as ```Area (cm^2)```). Column names which are Python keywords
        (like "list", "for", "import", etc) cannot be used.

        For example, if one of your columns is called ``a a`` and you want
        to sum it with ``b``, your query should be ```a a` + b``.

        .. versionadded:: 0.25.0
            Backtick quoting introduced.

        .. versionadded:: 1.0.0
            Expanding functionality of backtick quoting for more than only spaces.

    inplace : bool
        Whether the query should modify the data in place or return
        a modified copy.
    **kwargs
        See the documentation for :func:`eval` for complete details
        on the keyword arguments accepted by :meth:`DataFrame.query`.

    Returns
    -------
    DataFrame or None
        DataFrame resulting from the provided query expression or
        None if ``inplace=True``.

    See Also
    --------
    eval : Evaluate a string describing operations on
        DataFrame columns.
    DataFrame.eval : Evaluate a string describing operations on
        DataFrame columns.

    Notes
    -----
    The result of the evaluation of this expression is first passed to
    :attr:`DataFrame.loc` and if that fails because of a
    multidimensional key (e.g., a DataFrame) then the result will be passed
    to :meth:`DataFrame.__getitem__`.

    This method uses the top-level :func:`eval` function to
    evaluate the passed query.

    The :meth:`~pandas.DataFrame.query` method uses a slightly
    modified Python syntax by default. For example, the ``&`` and ``|``
    (bitwise) operators have the precedence of their boolean cousins,
    :keyword:`and` and :keyword:`or`. This *is* syntactically valid Python,
    however the semantics are different.

    You can change the semantics of the expression by passing the keyword
    argument ``parser='python'``. This enforces the same semantics as
    evaluation in Python space. Likewise, you can pass ``engine='python'``
    to evaluate an expression using Python itself as a backend. This is not
    recommended as it is inefficient compared to using ``numexpr`` as the
    engine.

    The :attr:`DataFrame.index` and
    :attr:`DataFrame.columns` attributes of the
    :class:`~pandas.DataFrame` instance are placed in the query namespace
    by default, which allows you to treat both the index and columns of the
    frame as a column in the frame.
    The identifier ``index`` is used for the frame index; you can also
    use the name of the index to identify it in a query. Please note that
    Python keywords may not be used as identifiers.

    For further details and examples see the ``query`` documentation in
    :ref:`indexing <indexing.query>`.

    *Backtick quoted variables*

    Backtick quoted variables are parsed as literal Python code and
    are converted internally to a Python valid identifier.
    This can lead to the following problems.

    During parsing a number of disallowed characters inside the backtick
    quoted string are replaced by strings that are allowed as a Python identifier.
    These characters include all operators in Python, the space character, the
    question mark, the exclamation mark, the dollar sign, and the euro sign.
    For other characters that fall outside the ASCII range (U+0001..U+007F)
    and those that are not further specified in PEP 3131,
    the query parser will raise an error.
    This excludes whitespace different than the space character,
    but also the hashtag (as it is used for comments) and the backtick
    itself (backtick can also not be escaped).

    In a special case, quotes that make a pair around a backtick can
    confuse the parser.
    For example, ```it's` > `that's``` will raise an error,
    as it forms a quoted string (``'s > `that'``) with a backtick inside.

    See also the Python documentation about lexical analysis
    (https://docs.python.org/3/reference/lexical_analysis.html)
    in combination with the source code in :mod:`pandas.core.computation.parsing`.

    Examples
    --------
    >>> df = pd.DataFrame({'A': range(1, 6),
    ...                    'B': range(10, 0, -2),
    ...                    'C C': range(10, 5, -1)})
    >>> df
       A   B  C C
    0  1  10   10
    1  2   8    9
    2  3   6    8
    3  4   4    7
    4  5   2    6
    >>> df.query('A > B')
       A  B  C C
    4  5  2    6

    The previous expression is equivalent to

    >>> df[df.A > df.B]
       A  B  C C
    4  5  2    6

    For columns with spaces in their name, you can use backtick quoting.

    >>> df.query('B == `C C`')
       A   B  C C
    0  1  10   10

    The previous expression is equivalent to

    >>> df[df.B == df['C C']]
       A   B  C C
    0  1  10   10

In [65]:
df.query("negative").assign(cool=lambda x: x["two"] / x["three"])

        one  negative      two     three      cool
a -0.732758      True  0.72716 -7.327579 -0.099236

In [86]:
df.loc["b":"d", "one":"two"]

        one  negative       two
b  0.827219     False  0.638470
c  0.223872     False  0.028091
d       NaN     False -0.972016

In [88]:
df.T

                 a         b         c         d
one      -0.732758  0.827219  0.223872       NaN
negative      True     False     False     False
two        0.72716   0.63847  0.028091 -0.972016
three    -7.327579  8.272193  2.238715       NaN

In [89]:
df.to_string()

'        one  negative       two     three\na -0.732758      True  0.727160 -7.327579\nb  0.827219     False  0.638470  8.272193\nc  0.223872     False  0.028091  2.238715\nd       NaN     False -0.972016       NaN'

In [107]:
dates = pd.date_range("20220101", periods=5)
date_df = pd.DataFrame(np.random.rand(5, 3), index=dates, columns=list("abc"))
date_df

                   a         b         c
2022-01-01  0.283531  0.562453  0.470664
2022-01-02  0.545342  0.335055  0.234532
2022-01-03  0.989477  0.600014  0.370401
2022-01-04  0.897044  0.487149  0.336388
2022-01-05  0.258644  0.322419  0.197952

In [108]:
date_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2022-01-01 to 2022-01-05
Freq: D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      float64
 1   b       5 non-null      float64
 2   c       5 non-null      float64
dtypes: float64(3)
memory usage: 160.0 bytes

In [109]:
date_df.tail(2)

                   a         b         c
2022-01-04  0.897044  0.487149  0.336388
2022-01-05  0.258644  0.322419  0.197952

In [110]:
date_df.sort_index(axis=1, ascending=False)

                   c         b         a
2022-01-01  0.470664  0.562453  0.283531
2022-01-02  0.234532  0.335055  0.545342
2022-01-03  0.370401  0.600014  0.989477
2022-01-04  0.336388  0.487149  0.897044
2022-01-05  0.197952  0.322419  0.258644

In [114]:
date_df[date_df["c"] > 0.25]

                   a         b         c
2022-01-01  0.283531  0.562453  0.470664
2022-01-03  0.989477  0.600014  0.370401
2022-01-04  0.897044  0.487149  0.336388

In [125]:
# dropna, fillna, isna
# df.dropna(axis=0)
# df.fillna(0.5)
df.isna()

     one  negative    two  three
a  False     False  False  False
b  False     False  False  False
c  False     False  False  False
d   True     False  False   True

In [130]:
# apply
date_df.apply(np.sum)

a    2.974038
b    2.307090
c    1.609936
dtype: float64

In [132]:
date_df.apply(lambda x: x.max() - x.min())

a    0.730833
b    0.277595
c    0.272712
dtype: float64